//JOB26 JOB (ACCT),'COBOL JOB',CLASS=A,MSGCLASS=X
//*
//* COMPILE AND RUN FOR SET 26
//*
//STEP1    EXEC IGYWCL,PARM.COBOL='LIB'
//COBOL.SYSIN DD DSN=USER.COBOL.SOURCE(MAIN26),DISP=SHR
//COBOL.SYSLIB DD DSN=USER.COBOL.COPYBOOKS,DISP=SHR
//*
//STEP2    EXEC PGM=MAIN26
//STEPLIB  DD DSN=USER.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=*
