       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR14.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC14.
       PROCEDURE DIVISION USING EMP-RECORD-14.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-14
           ADD 1000 TO EMP-SALARY-14
           DISPLAY 'SUBROUTINE SUBR14 EXECUTED FOR ID: ' EMP-ID-14
           GOBACK.
