       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR19.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC19.
       PROCEDURE DIVISION USING EMP-RECORD-19.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-19
           ADD 1000 TO EMP-SALARY-19
           DISPLAY 'SUBROUTINE SUBR19 EXECUTED FOR ID: ' EMP-ID-19
           GOBACK.
