       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR26.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC26.
       PROCEDURE DIVISION USING EMP-RECORD-26.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-26
           ADD 1000 TO EMP-SALARY-26
           DISPLAY 'SUBROUTINE SUBR26 EXECUTED FOR ID: ' EMP-ID-26
           GOBACK.
