       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR02.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC02.
       PROCEDURE DIVISION USING EMP-RECORD-02.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-02
           ADD 1000 TO EMP-SALARY-02
           DISPLAY 'SUBROUTINE SUBR02 EXECUTED FOR ID: ' EMP-ID-02
           GOBACK.
