       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR21.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC21.
       PROCEDURE DIVISION USING EMP-RECORD-21.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-21
           ADD 1000 TO EMP-SALARY-21
           DISPLAY 'SUBROUTINE SUBR21 EXECUTED FOR ID: ' EMP-ID-21
           GOBACK.
