       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR04.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC04.
       PROCEDURE DIVISION USING EMP-RECORD-04.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-04
           ADD 1000 TO EMP-SALARY-04
           DISPLAY 'SUBROUTINE SUBR04 EXECUTED FOR ID: ' EMP-ID-04
           GOBACK.
