       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR27.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC27.
       PROCEDURE DIVISION USING EMP-RECORD-27.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-27
           ADD 1000 TO EMP-SALARY-27
           DISPLAY 'SUBROUTINE SUBR27 EXECUTED FOR ID: ' EMP-ID-27
           GOBACK.
