       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR03.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC03.
       PROCEDURE DIVISION USING EMP-RECORD-03.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-03
           ADD 1000 TO EMP-SALARY-03
           DISPLAY 'SUBROUTINE SUBR03 EXECUTED FOR ID: ' EMP-ID-03
           GOBACK.
