       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR29.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC29.
       PROCEDURE DIVISION USING EMP-RECORD-29.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-29
           ADD 1000 TO EMP-SALARY-29
           DISPLAY 'SUBROUTINE SUBR29 EXECUTED FOR ID: ' EMP-ID-29
           GOBACK.
