       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR22.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC22.
       PROCEDURE DIVISION USING EMP-RECORD-22.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-22
           ADD 1000 TO EMP-SALARY-22
           DISPLAY 'SUBROUTINE SUBR22 EXECUTED FOR ID: ' EMP-ID-22
           GOBACK.
