       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR08.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC08.
       PROCEDURE DIVISION USING EMP-RECORD-08.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-08
           ADD 1000 TO EMP-SALARY-08
           DISPLAY 'SUBROUTINE SUBR08 EXECUTED FOR ID: ' EMP-ID-08
           GOBACK.
