       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR06.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC06.
       PROCEDURE DIVISION USING EMP-RECORD-06.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-06
           ADD 1000 TO EMP-SALARY-06
           DISPLAY 'SUBROUTINE SUBR06 EXECUTED FOR ID: ' EMP-ID-06
           GOBACK.
