       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR28.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC28.
       PROCEDURE DIVISION USING EMP-RECORD-28.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-28
           ADD 1000 TO EMP-SALARY-28
           DISPLAY 'SUBROUTINE SUBR28 EXECUTED FOR ID: ' EMP-ID-28
           GOBACK.
