       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR25.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC25.
       PROCEDURE DIVISION USING EMP-RECORD-25.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-25
           ADD 1000 TO EMP-SALARY-25
           DISPLAY 'SUBROUTINE SUBR25 EXECUTED FOR ID: ' EMP-ID-25
           GOBACK.
