       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR09.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC09.
       PROCEDURE DIVISION USING EMP-RECORD-09.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-09
           ADD 1000 TO EMP-SALARY-09
           DISPLAY 'SUBROUTINE SUBR09 EXECUTED FOR ID: ' EMP-ID-09
           GOBACK.
