       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR10.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC10.
       PROCEDURE DIVISION USING EMP-RECORD-10.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-10
           ADD 1000 TO EMP-SALARY-10
           DISPLAY 'SUBROUTINE SUBR10 EXECUTED FOR ID: ' EMP-ID-10
           GOBACK.
