       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR24.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC24.
       PROCEDURE DIVISION USING EMP-RECORD-24.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-24
           ADD 1000 TO EMP-SALARY-24
           DISPLAY 'SUBROUTINE SUBR24 EXECUTED FOR ID: ' EMP-ID-24
           GOBACK.
