       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR15.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC15.
       PROCEDURE DIVISION USING EMP-RECORD-15.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-15
           ADD 1000 TO EMP-SALARY-15
           DISPLAY 'SUBROUTINE SUBR15 EXECUTED FOR ID: ' EMP-ID-15
           GOBACK.
