       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR11.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC11.
       PROCEDURE DIVISION USING EMP-RECORD-11.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-11
           ADD 1000 TO EMP-SALARY-11
           DISPLAY 'SUBROUTINE SUBR11 EXECUTED FOR ID: ' EMP-ID-11
           GOBACK.
