       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR12.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC12.
       PROCEDURE DIVISION USING EMP-RECORD-12.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-12
           ADD 1000 TO EMP-SALARY-12
           DISPLAY 'SUBROUTINE SUBR12 EXECUTED FOR ID: ' EMP-ID-12
           GOBACK.
