       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR20.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC20.
       PROCEDURE DIVISION USING EMP-RECORD-20.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-20
           ADD 1000 TO EMP-SALARY-20
           DISPLAY 'SUBROUTINE SUBR20 EXECUTED FOR ID: ' EMP-ID-20
           GOBACK.
