       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR05.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC05.
       PROCEDURE DIVISION USING EMP-RECORD-05.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-05
           ADD 1000 TO EMP-SALARY-05
           DISPLAY 'SUBROUTINE SUBR05 EXECUTED FOR ID: ' EMP-ID-05
           GOBACK.
