       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR01.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC01.
       PROCEDURE DIVISION USING EMP-RECORD-01.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-01
           ADD 1000 TO EMP-SALARY-01
           DISPLAY 'SUBROUTINE SUBR01 EXECUTED FOR ID: ' EMP-ID-01
           GOBACK.
