       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR23.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC23.
       PROCEDURE DIVISION USING EMP-RECORD-23.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-23
           ADD 1000 TO EMP-SALARY-23
           DISPLAY 'SUBROUTINE SUBR23 EXECUTED FOR ID: ' EMP-ID-23
           GOBACK.
