       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR13.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC13.
       PROCEDURE DIVISION USING EMP-RECORD-13.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-13
           ADD 1000 TO EMP-SALARY-13
           DISPLAY 'SUBROUTINE SUBR13 EXECUTED FOR ID: ' EMP-ID-13
           GOBACK.
