       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR17.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC17.
       PROCEDURE DIVISION USING EMP-RECORD-17.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-17
           ADD 1000 TO EMP-SALARY-17
           DISPLAY 'SUBROUTINE SUBR17 EXECUTED FOR ID: ' EMP-ID-17
           GOBACK.
