       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR18.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC18.
       PROCEDURE DIVISION USING EMP-RECORD-18.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-18
           ADD 1000 TO EMP-SALARY-18
           DISPLAY 'SUBROUTINE SUBR18 EXECUTED FOR ID: ' EMP-ID-18
           GOBACK.
