       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR07.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC07.
       PROCEDURE DIVISION USING EMP-RECORD-07.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-07
           ADD 1000 TO EMP-SALARY-07
           DISPLAY 'SUBROUTINE SUBR07 EXECUTED FOR ID: ' EMP-ID-07
           GOBACK.
