       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR30.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC30.
       PROCEDURE DIVISION USING EMP-RECORD-30.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-30
           ADD 1000 TO EMP-SALARY-30
           DISPLAY 'SUBROUTINE SUBR30 EXECUTED FOR ID: ' EMP-ID-30
           GOBACK.
