       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBR16.
       DATA DIVISION.
       LINKAGE SECTION.
       COPY REC16.
       PROCEDURE DIVISION USING EMP-RECORD-16.
       MAIN-LOGIC.
           MOVE 'FULL TIME' TO EMP-STATUS-16
           ADD 1000 TO EMP-SALARY-16
           DISPLAY 'SUBROUTINE SUBR16 EXECUTED FOR ID: ' EMP-ID-16
           GOBACK.
